LukaJala/TELEMETRY/Basic_Cam_Copy/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# PSRAM (MIPI CSI frame buffer needs ~9MB, display needs ~3MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# PSRAM LDO (LDO channel 2 at 1.8 V for ESP32-P4)
CONFIG_ESP_LDO_CHAN_PSRAM_DOMAIN=2
CONFIG_ESP_LDO_VOLTAGE_PSRAM_1800_MV=y

# Camera XCLK generated by the ESP clock router (GPIO-mapped PLL output)
CONFIG_CAMERA_XCLK_USE_ESP_CLOCK_ROUTER=y

# Camera sensor driver — OV5647 (Waveshare RPi Camera B Rev 2.0)
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X1280_50FPS=y
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW8_800X1280_50FPS=y
CONFIG_CAMERA_OV5647_CSI_LINESYNC_ENABLE=y

# DMA2D in IRAM to prevent cache-miss stalls during DSI pixel transfers
CONFIG_DMA2D_OPERATION_FUNC_IN_IRAM=y
CONFIG_DMA2D_ISR_IRAM_SAFE=y

# Stack size for app_main
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
